---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.WallTypeIncompatibleWithTapered
source: html/73f257dc-72c4-a654-30bc-af124906d05a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.WallTypeIncompatibleWithTapered Property

This wall's type is not compatible with the Tapered cross-section. Tapered walls require a variable thickness layer.

## Syntax (C#)
```csharp
public static FailureDefinitionId WallTypeIncompatibleWithTapered { get; }
```